Revit 2027 API
BuiltInFailures.RebarShapeFailures.FormulaDrivenDimension Property
 Dimension can't be driven by a formula parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FormulaDrivenDimension { get; }
Public Shared ReadOnly Property FormulaDrivenDimension As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FormulaDrivenDimension {
	FailureDefinitionId^ get ();
}
static member FormulaDrivenDimension : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace